zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC800/periph3/PERI_I3C.h
/*
** ###################################################################
**     Processors:          LPC864M201JBD64
**                          LPC864M201JHI33
**                          LPC864M201JHI48
**                          LPC865M201JBD64
**                          LPC865M201JHI33
**                          LPC865M201JHI48
**
**     Version:             rev. 3.0, 2025-11-18
**     Build:               b260515
**
**     Abstract:
**         CMSIS Peripheral Access Layer for I3C
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.0 (2021-07-15)
**         Initial version.
**     - rev. 1.0 (2022-03-15)
**         Revesion of Rev. 1.
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 3.0 (2025-11-18)
**         Update m0p core interrupts dedication.
**
** ###################################################################
*/

/*!
 * @file PERI_I3C.h
 * @version 3.0
 * @date 2025-11-18
 * @brief CMSIS Peripheral Access Layer for I3C
 *
 * CMSIS Peripheral Access Layer for I3C
 */

#if !defined(PERI_I3C_H_)
#define PERI_I3C_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_LPC864M201JBD64) || defined(CPU_LPC864M201JHI33) || defined(CPU_LPC864M201JHI48))
#include "LPC864_COMMON.h"
#elif (defined(CPU_LPC865M201JBD64) || defined(CPU_LPC865M201JHI33) || defined(CPU_LPC865M201JHI48))
#include "LPC865_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- I3C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I3C_Peripheral_Access_Layer I3C Peripheral Access Layer
 * @{
 */

/** I3C - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCONFIG;                           /**< Controller Configuration Register, offset: 0x0 */
  __IO uint32_t SCONFIG;                           /**< Target Configuration register, offset: 0x4 */
  __IO uint32_t SSTATUS;                           /**< Target Status Register, offset: 0x8 */
  __IO uint32_t SCTRL;                             /**< Target Control Register, offset: 0xC */
  __IO uint32_t SINTSET;                           /**< Target Interrupt Set Register, offset: 0x10 */
  __IO uint32_t SINTCLR;                           /**< Target Interrupt Clear Register, offset: 0x14 */
  __I  uint32_t SINTMASKED;                        /**< Target Interrupt Mask Register, offset: 0x18 */
  __IO uint32_t SERRWARN;                          /**< Target Errors and Warnings Register, offset: 0x1C */
  __IO uint32_t SDMACTRL;                          /**< Target DMA Control Register, offset: 0x20 */
       uint8_t RESERVED_0[8];
  __IO uint32_t SDATACTRL;                         /**< Target Data Control Register, offset: 0x2C */
  __O  uint32_t SWDATAB;                           /**< Target Write Data Byte Register, offset: 0x30 */
  __O  uint32_t SWDATABE;                          /**< Target Write Data Byte End, offset: 0x34 */
  __O  uint32_t SWDATAH;                           /**< Target Write Data Half-word Register, offset: 0x38 */
  __O  uint32_t SWDATAHE;                          /**< Target Write Data Half-word End Register, offset: 0x3C */
  __I  uint32_t SRDATAB;                           /**< Target Read Data Byte Register, offset: 0x40 */
       uint8_t RESERVED_1[4];
  __I  uint32_t SRDATAH;                           /**< Target Read Data Half-word Register, offset: 0x48 */
       uint8_t RESERVED_2[8];
  __O  uint32_t SWDATAB1;                          /**< Target Write Data Byte Register, offset: 0x54 */
       uint8_t RESERVED_3[8];
  __I  uint32_t SCAPABILITIES;                     /**< Target Capabilities Register, offset: 0x60 */
  __IO uint32_t SDYNADDR;                          /**< Slave Dynamic Address Register, offset: 0x64 */
  __IO uint32_t SMAXLIMITS;                        /**< Target Maximum Limits Register, offset: 0x68 */
  __IO uint32_t SIDPARTNO;                         /**< Target ID Part Number Register, offset: 0x6C */
  __IO uint32_t SIDEXT;                            /**< Target ID Extension Register, offset: 0x70 */
  __IO uint32_t SVENDORID;                         /**< Target Vendor ID Register, offset: 0x74 */
  __IO uint32_t STCCLOCK;                          /**< Target Time Control Clock Register, offset: 0x78 */
  __I  uint32_t SMSGLAST;                          /**< Target Message Last Matched Register, offset: 0x7C */
       uint8_t RESERVED_4[4];
  __IO uint32_t MCTRL;                             /**< Controller Main Control Register, offset: 0x84 */
  __IO uint32_t MSTATUS;                           /**< Controller Status Register, offset: 0x88 */
  __IO uint32_t MIBIRULES;                         /**< Controller In-band Interrupt Registry and Rules Register, offset: 0x8C */
  __IO uint32_t MINTSET;                           /**< Controller Interrupt Set Register, offset: 0x90 */
  __O  uint32_t MINTCLR;                           /**< Controller Interrupt Clear Register, offset: 0x94 */
  __I  uint32_t MINTMASKED;                        /**< Controller Interrupt Mask Register, offset: 0x98 */
  __IO uint32_t MERRWARN;                          /**< Controller Errors and Warnings Register, offset: 0x9C */
  __IO uint32_t MDMACTRL;                          /**< Controller DMA Control Register, offset: 0xA0 */
       uint8_t RESERVED_5[8];
  __IO uint32_t MDATACTRL;                         /**< Controller Data Control Register, offset: 0xAC */
  __O  uint32_t MWDATAB;                           /**< Controller Write Data Byte Register, offset: 0xB0 */
  __O  uint32_t MWDATABE;                          /**< Controller Write Data Byte End Register, offset: 0xB4 */
  __O  uint32_t MWDATAH;                           /**< Controller Write Data Half-word Register, offset: 0xB8 */
  __O  uint32_t MWDATAHE;                          /**< Controller Write Data Halfword End, offset: 0xBC */
  __I  uint32_t MRDATAB;                           /**< Controller Read Data Byte Register, offset: 0xC0 */
       uint8_t RESERVED_6[4];
  __I  uint32_t MRDATAH;                           /**< Controller Read Data Half-word Register, offset: 0xC8 */
  __I  uint32_t MWDATAB1;                          /**< Controller Write Byte Data 1, offset: 0xCC */
  union {                                          /* offset: 0xD0 */
    __O  uint32_t MWMSG_SDR_CONTROL;                 /**< Controller Write Message in SDR mode, offset: 0xD0 */
    __O  uint32_t MWMSG_SDR_DATA;                    /**< Controller Write Message Data in SDR mode, offset: 0xD0 */
  };
  __I  uint32_t MRMSG_SDR;                         /**< Controller Read Message in SDR mode, offset: 0xD4 */
  union {                                          /* offset: 0xD8 */
    __O  uint32_t MWMSG_DDR_CONTROL;                 /**< Controller Write Message in DDR mode: First Control Word, offset: 0xD8 */
    __O  uint32_t MWMSG_DDR_DATA;                    /**< Controller Write Message Data in DDR mode, offset: 0xD8 */
  };
  __IO uint32_t MRMSG_DDR;                         /**< Controller Read Message in DDR mode, offset: 0xDC */
       uint8_t RESERVED_7[4];
  __IO uint32_t MDYNADDR;                          /**< Controller Dynamic Address, offset: 0xE4 */
       uint8_t RESERVED_8[52];
  __I  uint32_t SMAPCTRL0;                         /**< Map Feature Control 0, offset: 0x11C */
       uint8_t RESERVED_9[3804];
  __I  uint32_t SID;                               /**< Slave Module ID Register, offset: 0xFFC */
} I3C_Type;

/* ----------------------------------------------------------------------------
   -- I3C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I3C_Register_Masks I3C Register Masks
 * @{
 */

/*! @name MCONFIG - Controller Configuration Register */
/*! @{ */

