zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC800/periph3/PERI_I3C.h
#define I3C_SDYNADDR_MAPIDX_MASK                 (0xF00U)
#define I3C_SDYNADDR_MAPIDX_SHIFT                (8U)
/*! MAPIDX - Mapped Dynamic Address */
#define I3C_SDYNADDR_MAPIDX(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SDYNADDR_MAPIDX_SHIFT)) & I3C_SDYNADDR_MAPIDX_MASK)

#define I3C_SDYNADDR_MAPSA_MASK                  (0x1000U)
#define I3C_SDYNADDR_MAPSA_SHIFT                 (12U)
/*! MAPSA - Map a Static Address */
#define I3C_SDYNADDR_MAPSA(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SDYNADDR_MAPSA_SHIFT)) & I3C_SDYNADDR_MAPSA_MASK)

#define I3C_SDYNADDR_KEY_MASK                    (0xFFFF0000U)
#define I3C_SDYNADDR_KEY_SHIFT                   (16U)
/*! KEY - Key */
#define I3C_SDYNADDR_KEY(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_SDYNADDR_KEY_SHIFT)) & I3C_SDYNADDR_KEY_MASK)
/*! @} */

/*! @name SMAXLIMITS - Target Maximum Limits Register */
/*! @{ */

#define I3C_SMAXLIMITS_MAXRD_MASK                (0xFFFU)
#define I3C_SMAXLIMITS_MAXRD_SHIFT               (0U)
/*! MAXRD - Maximum read length */
#define I3C_SMAXLIMITS_MAXRD(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_SMAXLIMITS_MAXRD_SHIFT)) & I3C_SMAXLIMITS_MAXRD_MASK)

#define I3C_SMAXLIMITS_MAXWR_MASK                (0xFFF0000U)
#define I3C_SMAXLIMITS_MAXWR_SHIFT               (16U)
/*! MAXWR - Maximum write length */
#define I3C_SMAXLIMITS_MAXWR(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_SMAXLIMITS_MAXWR_SHIFT)) & I3C_SMAXLIMITS_MAXWR_MASK)
/*! @} */

/*! @name SIDPARTNO - Target ID Part Number Register */
/*! @{ */

#define I3C_SIDPARTNO_PARTNO_MASK                (0xFFFFFFFFU)
#define I3C_SIDPARTNO_PARTNO_SHIFT               (0U)
/*! PARTNO - Part number */
#define I3C_SIDPARTNO_PARTNO(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_SIDPARTNO_PARTNO_SHIFT)) & I3C_SIDPARTNO_PARTNO_MASK)
/*! @} */

/*! @name SIDEXT - Target ID Extension Register */
/*! @{ */

#define I3C_SIDEXT_DCR_MASK                      (0xFF00U)
#define I3C_SIDEXT_DCR_SHIFT                     (8U)
/*! DCR - Device Characteristic Register */
#define I3C_SIDEXT_DCR(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_SIDEXT_DCR_SHIFT)) & I3C_SIDEXT_DCR_MASK)

#define I3C_SIDEXT_BCR_MASK                      (0xFF0000U)
#define I3C_SIDEXT_BCR_SHIFT                     (16U)
/*! BCR - Bus Characteristics Register */
#define I3C_SIDEXT_BCR(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_SIDEXT_BCR_SHIFT)) & I3C_SIDEXT_BCR_MASK)
/*! @} */

/*! @name SVENDORID - Target Vendor ID Register */
/*! @{ */

#define I3C_SVENDORID_VID_MASK                   (0x7FFFU)
#define I3C_SVENDORID_VID_SHIFT                  (0U)
/*! VID - Vendor ID */
#define I3C_SVENDORID_VID(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SVENDORID_VID_SHIFT)) & I3C_SVENDORID_VID_MASK)
/*! @} */

/*! @name STCCLOCK - Target Time Control Clock Register */
/*! @{ */

#define I3C_STCCLOCK_ACCURACY_MASK               (0xFFU)
#define I3C_STCCLOCK_ACCURACY_SHIFT              (0U)
/*! ACCURACY - Clock accuracy */
#define I3C_STCCLOCK_ACCURACY(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_STCCLOCK_ACCURACY_SHIFT)) & I3C_STCCLOCK_ACCURACY_MASK)

#define I3C_STCCLOCK_FREQ_MASK                   (0xFF00U)
#define I3C_STCCLOCK_FREQ_SHIFT                  (8U)
/*! FREQ - Clock frequency */
#define I3C_STCCLOCK_FREQ(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STCCLOCK_FREQ_SHIFT)) & I3C_STCCLOCK_FREQ_MASK)
/*! @} */

/*! @name SMSGLAST - Target Message Last Matched Register */
/*! @{ */

#define I3C_SMSGLAST_MAPLAST_MASK                (0xFU)
#define I3C_SMSGLAST_MAPLAST_SHIFT               (0U)
/*! MAPLAST - Matched address index */
#define I3C_SMSGLAST_MAPLAST(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_MAPLAST_SHIFT)) & I3C_SMSGLAST_MAPLAST_MASK)

#define I3C_SMSGLAST_LASTSTATIC_MASK             (0x10U)
#define I3C_SMSGLAST_LASTSTATIC_SHIFT            (4U)
/*! LASTSTATIC - Last Static Address Matched */
#define I3C_SMSGLAST_LASTSTATIC(x)               (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTSTATIC_SHIFT)) & I3C_SMSGLAST_LASTSTATIC_MASK)

#define I3C_SMSGLAST_LASTGROUP_MASK              (0x20U)
#define I3C_SMSGLAST_LASTGROUP_SHIFT             (5U)
/*! LASTGROUP - Last Match Was Group */
#define I3C_SMSGLAST_LASTGROUP(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTGROUP_SHIFT)) & I3C_SMSGLAST_LASTGROUP_MASK)

#define I3C_SMSGLAST_LASTMODE_MASK               (0xC0U)
#define I3C_SMSGLAST_LASTMODE_SHIFT              (6U)
/*! LASTMODE - Last Mode
 *  0b00..SDR mode (or I2C if static) was the last mode.
 *  0b01..HDR-DDR was the last mode.
 *  0b10..HDR-BT was the last mode.
 *  0b11..RESERVED
 */
#define I3C_SMSGLAST_LASTMODE(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTMODE_SHIFT)) & I3C_SMSGLAST_LASTMODE_MASK)

#define I3C_SMSGLAST_MAPLASTM1_MASK              (0xF00U)
#define I3C_SMSGLAST_MAPLASTM1_SHIFT             (8U)
/*! MAPLASTM1 - Previous match index 1 */
#define I3C_SMSGLAST_MAPLASTM1(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_MAPLASTM1_SHIFT)) & I3C_SMSGLAST_MAPLASTM1_MASK)

#define I3C_SMSGLAST_LASTGROUPM1_MASK            (0x2000U)
#define I3C_SMSGLAST_LASTGROUPM1_SHIFT           (13U)
/*! LASTGROUPM1 - Last Match 1 Previous Was Group */
#define I3C_SMSGLAST_LASTGROUPM1(x)              (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTGROUPM1_SHIFT)) & I3C_SMSGLAST_LASTGROUPM1_MASK)

#define I3C_SMSGLAST_LASTMODE1_MASK              (0xC000U)
#define I3C_SMSGLAST_LASTMODE1_SHIFT             (14U)
/*! LASTMODE1 - Last Mode 1
 *  0b00..SDR mode (or I2C if static) was the last mode.
 *  0b01..HDR-DDR was the last mode.
 *  0b10..HDR-BT was the last mode.
 *  0b11..RESERVED
 */
#define I3C_SMSGLAST_LASTMODE1(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTMODE1_SHIFT)) & I3C_SMSGLAST_LASTMODE1_MASK)

#define I3C_SMSGLAST_MAPLASTM2_MASK              (0xF0000U)
#define I3C_SMSGLAST_MAPLASTM2_SHIFT             (16U)
/*! MAPLASTM2 - Previous match index 2 */
#define I3C_SMSGLAST_MAPLASTM2(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_MAPLASTM2_SHIFT)) & I3C_SMSGLAST_MAPLASTM2_MASK)

#define I3C_SMSGLAST_LASTGROUPM2_MASK            (0x200000U)
#define I3C_SMSGLAST_LASTGROUPM2_SHIFT           (21U)
/*! LASTGROUPM2 - Last Match 2 Previous Was Group */
#define I3C_SMSGLAST_LASTGROUPM2(x)              (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTGROUPM2_SHIFT)) & I3C_SMSGLAST_LASTGROUPM2_MASK)

#define I3C_SMSGLAST_LASTMODE2_MASK              (0xC00000U)
#define I3C_SMSGLAST_LASTMODE2_SHIFT             (22U)
/*! LASTMODE2 - Last Mode 2
 *  0b00..SDR mode (or I2C if static) was the last mode 2 previous accesses ago.
 *  0b01..HDR-DDR was the last mode 2 previous accesses ago.
 *  0b10..HDR-BT was the last mode 2 previous accesses ago.
 *  0b11..RESERVED
 */
#define I3C_SMSGLAST_LASTMODE2(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SMSGLAST_LASTMODE2_SHIFT)) & I3C_SMSGLAST_LASTMODE2_MASK)
/*! @} */

/*! @name MCTRL - Controller Main Control Register */
/*! @{ */

#define I3C_MCTRL_REQUEST_MASK                   (0x7U)
#define I3C_MCTRL_REQUEST_SHIFT                  (0U)
/*! REQUEST - Request
 *  0b000..NONE: Indicates that no request is present. The REQUEST field returns to NONE when finished with any
 *         request. The MSTATUS register indicates the state of the controller. See also AutoIBI mode. NONE is only
 *         written as 0: writing 1 to MCTRL[RDTERM] (to stop a read in progress) or when setting MCTRL[IBIRESP] for
 *         MSG use.
 *  0b001..EMITSTARTADDR: Emit START with address and direction from a stopped state or in the middle of a Single
 *         Data Rate (SDR) message. If from a stopped state (IDLE), then emit start may be prevented by an event
 *         (like IBI, MR, HJ), in which case the appropriate interrupt is signaled; note that Emit START can be
 *         resubmitted.
 *  0b010..EMITSTOP: Emit a STOP on bus. Must be in Single Data Rate (SDR) mode. If in Dynamic Address Assignment
 *         (DAA) mode, Emit stop will exit DAA mode.
 *  0b011..IBIACKNACK: Manual In-Band Interrupt (IBI) Acknowledge (ACK) or Not Acknowledge (NACK). When IBIRESP
 *         has indicated a hold on an In-Band Interrupt to allow a manual decision, this request completes it. Uses
 *         IBIRESP to provide the information.
 *  0b100..PROCESSDAA: If not currently in Dynamic Address Assignment (DAA) mode, emits START, 7E, ENTDAA
 *         sequence, then emits 7E/R to process the first target. Stops just before the new Dynamic Address (DA) is to be
 *         emitted. The DA is written using Controller Write Data Byte (MWDATAB), then Process DAA is requested
 *         again to write the new address, and then it starts the next unless marked to STOP. An MSTATUS indicating
 *         NACK means DA was not accepted (for example, parity error). If PROCESSDAA is NACKED on the 7E/R request,
 *         meaning no more targets need a DA, then a COMPLETE is signaled (along with DONE) and a STOP issued. If
 *         TYPE = 2 or TYPE = 3, the DA is assigned and then it emits a STOP (instead of starting a new 7E/R request).
 *         If TYPE = 1 or TYPE = 3, then the DA is taken from the ADDR field (bits 6:0).
 *  0b101..RESERVED
 *  0b110..FORCEEXIT and IBHR: Emit an Exit Pattern from any state. End Double Data Rate (DDR) mode (including
 *         MSGDDR), including a STOP afterward. If MCTRL[TYPE] is 2, perform a Target Reset action (RSTACT can prevent
 *         the reset in the target). Target Reset may follow immediately after RSTACT CCC or after STOP.
 *  0b111..AUTOIBI: Hold in a stopped state, but auto-emit START,7E when the target is holding down SDA to get an
 *         In-Band Interrupt (IBI). Actual In-Band Interrupt handling is defined by IBIRESP.
 */
#define I3C_MCTRL_REQUEST(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_REQUEST_SHIFT)) & I3C_MCTRL_REQUEST_MASK)

#define I3C_MCTRL_TYPE_MASK                      (0x30U)
#define I3C_MCTRL_TYPE_SHIFT                     (4U)
/*! TYPE - Bus type with START
 *  0b00..I3C: Normally the SDR mode of I3C. For ForceExit, the Exit pattern.
 *  0b01..I2C: Normally the Standard I2C protocol.
 *  0b10..DDR: (Double Data Rate): Normally the HDR-DDR mode of I3C. Enter DDR mode (7E and then ENTHDR0), if the
 *        module is not already in DDR mode. The 1st byte written to the TX FIFO should be a command, and should
 *        already be in the FIFO. To end DDR mode, use ForceExit. For ForceExit, the normal IBHR (In-Band Hardware
 *        Reset).
 *  0b11..For ForcedExit, this is forced IBHR.
 */
#define I3C_MCTRL_TYPE(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_TYPE_SHIFT)) & I3C_MCTRL_TYPE_MASK)

#define I3C_MCTRL_IBIRESP_MASK                   (0xC0U)
#define I3C_MCTRL_IBIRESP_SHIFT                  (6U)
/*! IBIRESP - In-Band Interrupt (IBI) response
 *  0b00..ACK (acknowledge). When REQUEST = 1 (EmitStartAddr) or REQUEST = 7 (AutoIBI), ACK with mandatory byte
 *        (or not), decided by the Controller In-band Interrupt Registry and Rules (MIBIRULES) register. When REQUEST
 *        = 3 (IBIAckNack), ACK with no mandatory byte.
 *  0b01..NACK: Not acknowledge
 *  0b10..Acknowledge with mandatory byte. When REQUEST = 1 or REQUEST = 7, ignore the MIBIRULES register. Do not
 *        use this setting unless only targets with a mandatory byte can cause an IBI. When REQUEST = 3, ACK with
 *        mandatory byte.
 *  0b11..Manual. When REQUEST = 1 or REQUEST = 7, stop and wait for a decision using the IBI ACK NACK request. When REQUEST = 3, reserved.
 */
#define I3C_MCTRL_IBIRESP(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_IBIRESP_SHIFT)) & I3C_MCTRL_IBIRESP_MASK)

